cmsis-svd/cmsis-svd/data/NXP/LPC11xx_v6.xml
				</field>
			</fields>
		</register>
		<register>
			<name>SYSTCKCAL</name>
			<description>System tick counter calibration</description>
			<addressOffset>0x154</addressOffset>
			<access>read-write</access>
			<resetValue>0x004</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>CAL</name>
					<description>System tick timer calibration value</description>
					<bitRange>[25:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:26]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>NMISRC</name>
			<description>NMI source selection</description>
			<addressOffset>0x174</addressOffset>
			<access>read-write</access>
			<resetValue>0x000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>IRQNO</name>
					<description>The IRQ number of the interrupt that acts as the Non-Maskable Interrupt (NMI) if bit 31 in this register is 1. See Table 54 for the list of interrupt sources and their IRQ numbers.</description>
					<bitRange>[4:0]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[30:5]</bitRange>
				</field>
				<field>
					<name>NMIEN</name>
					<description>Write a 1 to this bit to enable the Non-Maskable Interrupt (NMI) source selected by bits 4:0.</description>
					<bitRange>[31:31]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTAPRP0</name>
			<description>Start logic edge control register 0</description>
			<addressOffset>0x200</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>APRPIO0_0</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>APRPIO0_1</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>APRPIO0_2</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>APRPIO0_3</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>APRPIO0_4</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>APRPIO0_5</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>APRPIO0_6</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>APRPIO0_7</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>APRPIO0_8</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>APRPIO0_9</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>APRPIO0_10</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>APRPIO0_11</name>
					<description>Edge select for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>APRPIO1_0</name>
					<description>Edge select for start logic input PIO1_0 0 = Falling edge 1 = Rising edge</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved bits in this register.</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTERP0</name>
			<description>Start logic signal enable register 0</description>
			<addressOffset>0x204</addressOffset>
			<access>read-write</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>ERPIO0_0</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>ERPIO0_1</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>ERPIO0_2</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>ERPIO0_3</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>ERPIO0_4</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>ERPIO0_5</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>ERPIO0_6</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>ERPIO0_7</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>ERPIO0_8</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>ERPIO0_9</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>ERPIO0_10</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>ERPIO0_11</name>
					<description>Enable start signal for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>ERPIO1_0</name>
					<description>Enable start signal for start logic input PIO1_0 0 = Disabled 1 = Enabled</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved bits in this register.</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTRSRP0CLR</name>
			<description>Start logic reset register 0</description>
			<addressOffset>0x208</addressOffset>
			<access>write-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>RSRPIO0_0</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_1</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_2</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_3</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_4</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_5</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_6</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_7</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_8</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_9</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_10</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>RSRPIO0_11</name>
					<description>Start signal reset for start logic input PIO0_n:PIO0_11 to PIO0_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>RSRPIO1_0</name>
					<description>Start signal reset for start logic input PIO1_0 0 = Do nothing. 1 = Writing 1 resets the start signal.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved. Do not write a 1 to reserved bits in this register.</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>STARTSRP0</name>
			<description>Start logic status register 0</description>
			<addressOffset>0x20C</addressOffset>
			<access>read-only</access>
			<resetValue>0</resetValue>
			<resetMask>0x00000000</resetMask>
			<fields>
				<field>
					<name>SRPIO0_0</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[0:0]</bitRange>
				</field>
				<field>
					<name>SRPIO0_1</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[1:1]</bitRange>
				</field>
				<field>
					<name>SRPIO0_2</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[2:2]</bitRange>
				</field>
				<field>
					<name>SRPIO0_3</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[3:3]</bitRange>
				</field>
				<field>
					<name>SRPIO0_4</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[4:4]</bitRange>
				</field>
				<field>
					<name>SRPIO0_5</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[5:5]</bitRange>
				</field>
				<field>
					<name>SRPIO0_6</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[6:6]</bitRange>
				</field>
				<field>
					<name>SRPIO0_7</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[7:7]</bitRange>
				</field>
				<field>
					<name>SRPIO0_8</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[8:8]</bitRange>
				</field>
				<field>
					<name>SRPIO0_9</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[9:9]</bitRange>
				</field>
				<field>
					<name>SRPIO0_10</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[10:10]</bitRange>
				</field>
				<field>
					<name>SRPIO0_11</name>
					<description>Start signal status for start logic input PIO0_n: PIO0_11 to PIO0_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[11:11]</bitRange>
				</field>
				<field>
					<name>SRPIO1_0</name>
					<description>Start signal status for start logic input PIO1_0 0 = No start signal received. 1 = Start signal pending.</description>
					<bitRange>[12:12]</bitRange>
				</field>
				<field>
					<name>RESERVED</name>
					<description>Reserved</description>
					<bitRange>[31:13]</bitRange>
				</field>
			</fields>
		</register>
		<register>
			<name>PDSLEEPCFG</name>
			<description>Power-down states in Deep-sleep mode</description>
			<addressOffset>0x230</addressOffset>
			<access>read-write</access>
			<resetValue>0x00000000</resetValue>
			<resetMask>0xFFFFFFFF</resetMask>
			<fields>
				<field>
					<name>NOTUSED0</name>
					<description>Reserved. Always write these bits as 111.</description>
					<bitRange>[2:0]</bitRange>

