cmsis-svd/cmsis-svd/data/NXP/LPC11xx_v6.xml
			<register>																						
				<name>IC</name>																					
				<description>Interrupt clear register for port n</description>																					
				<addressOffset>0x801C</addressOffset>																					
				<access>write-only</access>																					
				<resetValue>0x00</resetValue>																					
				<resetMask>0xFFFFFFFF</resetMask>																					
				<fields>																					
					<field>																				
						<name>CLR0</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[0:0]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR1</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[1:1]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR2</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[2:2]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR3</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[3:3]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR4</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[4:4]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR5</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[5:5]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR6</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[6:6]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR7</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[7:7]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR8</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[8:8]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR9</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[9:9]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR10</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[10:10]</bitRange>																			
					</field>																				
					<field>																				
						<name>CLR11</name>																			
						<description>Selects interrupt on pin x to be cleared (x = 0 to 11). Clears the interrupt edge detection logic. This register is write-only. The synchronizer between the GPIO and the NVIC blocks causes a delay of 2 clocks. It is recommended to add two NOPs after the clear of the interrupt edge detection logic before the exit of the interrupt service routine. 0 = No effect. 1 = Clears edge detection logic for pin PIOn_x.</description>																			
						<bitRange>[11:11]</bitRange>																			
					</field>																				
					<field>																				
						<name>RESERVED</name>																			
						<description>Reserved</description>																			
						<bitRange>[31:12]</bitRange>																			
					</field>																				
				</fields>																					
			</register>																						
